Repository: bfavrel/d6_drupal_sirtaqui
Catalog: sirtaqui_content_listing/translations/*.po
Languages: fr

source: Results by page
fr: Résultats par page

source: Keep user search inputs stored permanently
fr: Conserver les données de recherche de l'utilisateur de manière permanente

source: If unchecked, user search will be cleared everytime a user leave a listing.
fr: Si non-coché, les données de recherches de l'utilisateur sont réinitialisées à chaque fois qu'il quitte un listing.

source: Use compatibility with old version
fr: Utiliser la compatibilité avec l'ancienne version

source: For websites which already have content listings set when they go updated with the new version of module (featuring Forms!)<br /> In the new version, forms and listing are created together. Whith compatibility mode set, some checks are performed when admin displays the config form, and if form doesn't exist in database it is created.<br /> Disabling this options if not needed can save a couple of database queries.
fr: Pour les sites dont les listings ont déjà été paramétrés et qui sont mis à jour avec la nouvelle version du module (incluant Forms!)<br /> Dans la nouvelle version, les formulaires et les listings sont créés simultanément. Avec le mode de compatibilité activé, une verification de l'existence du formulaire en base de données est effectuée, et, le cas échéant, le formulaire est créé.<br /> Désactiver cette option si elle n'est pas nécessaire conduit à économiser quelques requêtes SQL.

source: This hook is called at the very end of the process, just before SQL compilation.<br /> Order start at '1'. If set to '0', hook will be discarded.
fr: Ce hook est appelé à la fin du process, juste avant la compilation SQL.<br />Ordre commence à '1'. S'il est paramétré à '0', le hook sera ignoré.

source: No hook set
fr: Aucun hook

source: If hook sirtaqui_content_listing_scl_query() has been activated, it's possible to choose how to integer its clause against existing ORDER BY set by other modules.
fr: Si le hook sirtaqui_content_listing_scl_query() a été activé, il est possible de choisir comment sa clause va s'intégrer au sein des ORDER BY déjà définis par les autres modules.

source: hook sirtaqui_content_listing_scl_query() behavior
fr: Comportement du hook sirtaqui_content_listing_scl_query()

source: At this point, filters have been processed
fr: A ce niveau, les filtres ont été processed

source: Display SCL queries in Drupal messages zone (only for UID 1 and in front end)
fr: Affiche les requêtes SCL dans la zone de message de Drupal (seulement pour UID 1 en front)

source: Language neutral
fr: Indépendant de la langue

source: edit
fr: modifier

source: delete
fr: supprimer

source: No listing available.
fr: Aucun listing disponible.

source: Listing Name
fr: Nom du listing

source: Content type(s)
fr: Type(s) de contenu

source: Delete last content type
fr: Supprimer le dernier type de contenu

source: Add content type
fr: Ajouter un type de contenu

source: Create listing
fr: Créer un listing

source: Error while saving sirtaqui content listing %content
fr: Erreur lors de la création du listing %content

source: Save listing
fr: Sauvegarder le listing

source: Sorting
fr: Tri

source: Available fields
fr: Champs disponibles

source: * shared fields
fr: * champs communs

source: 'ORDER BY' clause fragment
fr: Fragment de clause 'ORDER BY'

source: This fragment will be inserted in query, as this : <br />ORDER BY <strong>[THE FRAGMENT]</strong>
fr: Le fragment sera inséré comme tel :<br />ORDER BY <strong>[THE FRAGMENT]</strong>

source: Preview
fr: Aperçu

source: all
fr: tout

source: Language filter
fr: Filtrer la langue

source: Fields to display in preview, in addition to 'nid', 'title' and 'type'
fr: Champs à afficher, en plus de 'nid', 'title' et 'type'

source: Additional extractions
fr: Extractions supplémentaires

source: More fields to select, with or without aliases, separated with commas.
fr: Champs à sélectionner en plus, avec ou sans alias, séparés par une virgule

source: Number of results
fr: Nombre de résultats

source: Use user filters
fr: Utiliser les filtres

source: Use advanced filters
fr: Utiliser les filtres avancés

source: Use calls to hook_scl_query()
fr: Utiliser les appels aux hook_scl_query()

source: Try the sort
fr: Tester le tri

source: Publish the sort
fr: Publier le tri

source: Sorting has been saved
fr: Le tri a été sauvegardé

source: Generated query
fr: Requête générée

source: Oops ! The query has a problem
fr: Oups ! Il y a une couille dans le potage

source: Generated query fragment
fr: Fragment de requête généré

source: Generated query JOIN
fr: Clauses JOIN générées

source: Filter for
fr: Filtre pour

source: 'WHERE' clause fragment
fr: Fragment de clause 'WHERE'

source: Think to include fields '_f' as well ! <br />This fragment will be inserted in query, as this : <br />WHERE ( (n.type='<strong>%content_type</strong>' AND (<strong>[THE FRAGMENT]</strong>)) OR (n.type='<em>another_content_type</em>' AND (<em>[another fragment]</em>)) OR ... ) AND <em>other query stuff</em>...
fr: Penser à inclure également les champs '_f' !<br />Ce fragment sera inséré dans la requête, comme ceci:<br />WHERE ( (n.type='<strong>%content_type</strong>' AND (<strong>[THE FRAGMENT]</strong>)) OR (n.type='<em>another_content_type</em>' AND (<em>[another fragment]</em>)) OR ... ) AND <em>autres trucs de la requête</em>...

source: Use sorting
fr: Utiliser le tri

source: Try the filters
fr: Tester les filtres

source: Publish the filters
fr: Publier les filtres

source: Filters have been saved
fr: Les filtres ont été sauvegardés

source: on @count
fr: sur @count

source: Title
fr: Titre

source: Status
fr: Statut

source: - No result -
fr: - Aucun résultat -

source: Listing preview
fr: Previsualisation du listing

source: -- Select a value --
fr: -- Sélectionner une valeur --

source: Filters for
fr: Filtres pour

source: Add filter
fr: Ajouter un filtre

source: Nodes filter
fr: Filtre de nodes

source: If one node or more are selected, only these nodes will be displayed in listing.<br />If nothing is selected all nodes will be displayed.
fr: Si un ou plusieurs nodes sont sélectonnés, seuls ces nodes seront affichés dans le listing.<br />Si aucun n'est sélectionné, tous les nodes seront affichés.

source: published
fr: publié

source: not published
fr: non publié

source: Save filters
fr: Sauvegarder les filtres

source: Error while saving sirtaqui content listing
fr: Erreur lors de la sauvegarde du listing

source: Bad argument given
fr: Argument fourni erroné

source: Are you sure you want to delete the content listing %title?
fr: Êtes-vous sûr(e) de vouloir supprimer le listing %title ?

source: This action cannot be undone.
fr: Cette action est irréversible.

source: Delete
fr: Supprimer

source: Cancel
fr: Annuler

source: Deleted sirtaqui content listing %label.
fr: Listing %label supprimé

source: 1 node selected
fr: 1 node sélectionné

source: Views was generated for %content
fr: La Vue a été générée pour le contenu %content

source: Edit '@listing' listing
fr: Edition du listing '@listing'

source: Hide disabled entries
fr: Masquer les entrée désactivées

source: Show disabled entries
fr: Afficher les entrée désactivées

source: Common
fr: Commun

source: Search results in this fields also
fr: Rechercher également les résultats dans ces champs

source: Results matching
fr: Correspondance des résultats

source: Results contain the term
fr: Les résultats contiennent le terme entré

source: Results start by the term
fr: Les résultats commencent par le terme entré

source: Results match the term
fr: Les résultats doivent correspondre exactement au terme entré

source: Use autocompletion
fr: Utiliser l'autocompletion

source: Minimum number of letters to type before triggering.<br />'0' = autocompletion disabled
fr: Nombre minimum de lettres à entrer avant déclenchement.<br />'0' = autocomplétion désactivée

source: Results have to be...
fr: Les résultats doivent être...

source: equal at entered value
fr: égaux à la valeur entrée

source: different from entered value
fr: différents de la valeur entrée

source: lower than entered value
fr: inférieurs à la valeur entrée

source: lower or equal than entered value
fr: inférieurs ou égaux la valeur entrée

source: greater than entered value
fr: supérieurs à la valeur entrée

source: greater or equal than entered value
fr: supérieurs ou égaux à la valeur entrée

source: Result mode
fr: Correspondance des résultats

source: Results have to match at least one selected option
fr: Les resultats doivent satisfaire à au moins une des options sélectionnées

source: Results have to match all selected options
fr: Les résultats doivent satisfaire à toutes les options sélectionnées

source: Show the results which
fr: Les résultats doivent

source: have their both dates surrounding the searched period
fr: avoir leurs deux dates encadrant la période recherchée

source: have at least their start date in the searched period
fr: avoir au moins la date de début dans la période recherchée

source: have at least their end date in the searched period
fr: avoir au moins la date de fin dans la période recherchée

source: have their both dates surrounded by the searched period
fr: avoir leurs deux dates encadrées par la période recherchée

source: last option results are necessarily included in those of its two preceding options.<br />Hence, it is only applicable as a constraint if they aren't checked.
fr: les résultats de la dernière option feront nécessairement partie de ceux des deux précédentes options.<br />Cette option n'aura donc un quelconque effet que si elles sont décochées.

source: administer sirtaqui content listing
fr: administrer sirtaqui_content_listing

source: administer SCL advanced features
fr: administrer les fonctions avancées de SCL

source: Content listings
fr: Listings

source: SIRTAqui create contents listing
fr: SIRTAqui créer un listing

source: SIRTAqui edit contents listing
fr: SIRTAqui éditer un listing

source: Edit contents listing
fr: Editer un listing

source: Filters
fr: Filtres

source: Advanced filters
fr: Filtres avancés

source: SIRTAqui delete content listing
fr: SIRTAqui supprimer un listing

source: SIRTAqui delete all listing links
fr: Supprimer tous les liens SIRTAqui

source: Search form
fr: Formulaire de recherche

source: Body
fr: Corps

source: No result
fr: Aucun résultat

source: <span class="nb-items">1</span> result
fr: <span class="nb-items">1</span> resultat
